[
  {
    "types": ["hardcoded_secret"],
    "subtypes": ["aws", "aws_key"],
    "severity": ["critical"],
    "roasts": [
      "I see you've hardcoded an AWS key in {file}. Jeff Bezos thanks you for the donation.",
      "Posting AWS keys in {file}? Bold move. Let's see if your bank account handles it as well as your code does.",
      "This AWS key in line {line} is more public than your browser history. Revoke it.",
      "Did you confuse 'private key' with 'public announcement'? Because that's what this AWS key is.",
      "Congratulations, you just sponsored a crypto mining botnet with that AWS key in {file}."
    ]
  },
  {
    "types": ["hardcoded_secret"],
    "subtypes": ["stripe", "stripe_key"],
    "severity": ["critical", "high"],
    "roasts": [
      "Stripe keys in code? I hope you like paying for other people's subscriptions.",
      "This Stripe key in {file} is the financial equivalent of leaving your wallet on a park bench.",
      "Line {line}: A Stripe key. Your PCI compliance officer just started crying.",
      "Free money! That's what this Stripe key says to hackers.",
      "Hardcoding payment keys? Bold strategy. Let's see if it pays off (it won't)."
    ]
  },
  {
    "types": ["hardcoded_secret"],
    "subtypes": ["openai", "anthropic", "ai_key"],
    "severity": ["critical"],
    "roasts": [
      "Your OpenAI key in {file} is about to generate a very expensive bill.",
      "Sam Altman thanks you for the contribution to the compute fund.",
      "Hardcoding AI keys? I guess you want the AI to learn how to steal your money first.",
      "Line {line}: This API key is going to hallucinate a zero balance in your bank account."
    ]
  },
  {
    "types": ["hardcoded_secret"],
    "subtypes": ["github", "github_token"],
    "severity": ["critical"],
    "roasts": [
      "GitHub token found. Now everyone can push to master. Great job.",
      "You might as well give root access to the entire internet with this GitHub token in {file}.",
      "Line {line}: Goodbye repo, hello ransomware.",
      "Committing GitHub tokens is the developer equivalent of leaving your house keys in the door."
    ]
  },
  {
    "types": ["hardcoded_secret"],
    "subtypes": ["google", "google_key"],
    "severity": ["critical", "high"],
    "roasts": [
      "Google API key found. I hope you have a high credit limit.",
      "Line {line}: This Google key is now public property. Enjoy the usage spikes.",
      "Do you want ants? Because leaving Google keys in {file} is how you get malicious bots."
    ]
  },
  {
    "types": ["code_issue"],
    "subtypes": ["sql_injection", "sql"],
    "severity": ["critical"],
    "roasts": [
      "Bobby Tables would be proud of this SQL injection in {file}.",
      "Line {line}: Concatenating SQL strings? What is this, 1999?",
      "Your database is about to become everyone's database with this query.",
      "Standard procedure: Parameterize queries. Your procedure: Yolo concatenation.",
      "This verification is brought to you by 'DROP TABLE users; --"
    ]
  },
  {
    "types": ["code_issue"],
    "subtypes": ["xss", "xss_react", "xss_href", "xss_innerhtml"],
    "severity": ["high", "medium"],
    "roasts": [
      "dangerouslySetInnerHTML? The name literally tells you not to do it.",
      "Line {line}: Cross-Site Scripting is so retro. And so easy with this code.",
      "You're letting users inject scripts in {file}. I'm sure they'll be nice about it.",
      "innerHTML is not a bucket for user input. Clean it up.",
      "javascript: URIs? Really? In this economy?"
    ]
  },
  {
    "types": ["code_issue"],
    "subtypes": ["eval", "command_injection", "exec"],
    "severity": ["critical", "high"],
    "roasts": [
      "Using eval() in {file}? Why not just install the malware yourself?",
      "Line {line}: Executing arbitrary commands. What could go wrong?",
      "Eval is evil. You are creating a remote shell for hackers.",
      "Command injection in line {line}. You're basically running a 'Hack Me' server."
    ]
  },
  {
    "types": ["crypto_issue"],
    "subtypes": ["weak_crypto/md5", "md5"],
    "severity": ["medium"],
    "roasts": [
      "MD5? I can crack this hash on a toaster.",
      "Line {line}: MD5 is not encryption. It's a suggestion.",
      "Stop using MD5 in {file}. It's been broken since before you were born.",
      "Using MD5 for passwords? You might as well use ROT13."
    ]
  },
  {
    "types": ["crypto_issue"],
    "subtypes": ["weak_crypto/sha1", "sha1"],
    "severity": ["medium"],
    "roasts": [
      "SHA1 is dead. Let it go.",
      "Google broke SHA1 years ago. Why are you still using it in {file}?",
      "Line {line}: SHA1 collision attacks are real. Update your hashing."
    ]
  },
  {
    "types": ["crypto_issue"],
    "subtypes": ["weak_crypto/des", "des"],
    "severity": ["medium"],
    "roasts": [
      "DES? The 70s called, they want their encryption back.",
      "Line {line}: DES can be cracked in seconds. Use AES.",
      "Using DES in {file} is like locking your door with a piece of tape."
    ]
  },
  {
    "types": ["code_issue"],
    "subtypes": ["debug_mode", "console_log"],
    "severity": ["high", "medium", "low"],
    "roasts": [
      "Debug mode enabled? I hope this isn't going to production.",
      "Line {line}: Console.log debugging is fine, leaving it in is amateur hour.",
      "Shipping debug code in {file}? That's a paddling."
    ]
  },
  {
    "types": ["code_issue", "crypto_issue"],
    "subtypes": ["generic", "default"],
    "severity": ["critical", "high", "medium", "low"],
    "roasts": [
      "This code in {file} makes me want to `rm -rf /`.",
      "I've seen better security on a diary lock.",
      "Line {line}: This is why we can't have nice things.",
      "You call this code? I call it a liability.",
      "Fix this issue in {file} or I'm telling your manager.",
      "This vulnerability is so obvious, I suspect you did it on purpose.",
      "Security by obscurity is not a strategy. Neither is this.",
      "If incompetence was a currency, this line would be a bitcoin."
    ]
  }
]
